# #Запрашиваем значение у пользователя
# num = float(input("Введите число: "))
# # Сохраняем подходящее значение в переменной result
# if num > 0:
#  result = "Введено положительное число"
# elif num < 0:
#  result = "Введено отрицательное число"
# else:
#  result = "Введен ноль"
# # Отобразим результат
# print(result)


# num = float(input("Введите возраст: "))
# if num <= 2:
#     print("Возраст собаки равен", num*10.5)
# elif 2 <= num <= 4:
#     print("Возраст собаки равен", num*4)
# else:
#     print("Возраст собаки равен", num*7)


# num = (input("Введите букву лат. алфавита: "))
# if num == "a" or num == "e" or num == "i" or num == "o" or num == "u":
#     print("Буква глассная")
# elif num == "y":
#     print("Буква может быть как глассная, так и соглассная")
# else:
#     print("Буква соглассная")

# num = (input("Введите кол-во сторон фигуры: "))
# if num == "3":
#     print("Ваша фигура треугольник")
# if num == "4":
#     print("Ваша фигура квадрат, прямоугольник или трапеция")
# if num == "5":
#     print("Ваша фигура пятиугольник")
# if num == "6":
#     print("Ваша фигура шестиугольник")
# if num == "7":
#     print("Ваша фигура семиугольник")
# if num == "8":
#     print("Ваша фигура восьмиугольник")
# if num == "9":
#     print("Ваша фигура девятиугольник")
# if num == "10":
#     print("Ваша фигура десятиугольник")
# elif num < "3" or num > "10":
#     print("укажите правильное кол-во сторон от 3 до 10")

# num = (input("Введите название месяца: "))
# if num == "январь" or num =="март" or num == "май" or num == "июль" or num == "август" or num == "октябрь" or num == "декабрь":
#     print("31 день")
# if num == "апрель" or num =="июнь" or num == "сентябрь" or num == "ноябрь":
#     print("30 дней")
# if num == ("февраль"):
#     print("как как из 28, так и из 29 дней")


# num = int(input("введите уровень шума в децибелах: "))
# if num == 40:
#     print("Тихая комната")
# if 40 < num < 70:
#     print("между тихой комнатой и будильником")
# if num == 70:
#     print("Будильник")
# elif 70 < num < 106:
#     print("между будильником и газовой газонокосилкой")
# if num == 106:
#     print("газовая газонокосилка")
# elif 106  < num < 130:
#     print("между газовой газонокосилкой и отбойным молотком ")
# if num == 130:
#      print("Отбойный молоток ")
# if num < 40 or num > 130:
#     print("значение ниже минимального или больше максимального")

# num1 = int(input("введите длинну первой стороны треугольника: "))
# num2 = int(input("введите длинну второй стороны треугольника: "))
# num3 = int(input("введите длинну третьей стороны треугольника: "))
# if num1 == num2 == num3:
#     print("Ваш треугольник равносторонний")
# elif num1 == num2 or num2 == num3 or num1 == num3:
#     print("Ваш треугольник равнобедренный")
# else:
#     print("Ваш треугольник разносторонний")



# C4_FREQ = 261.63
# D4_FREQ = 293.66
# E4_FREQ = 329.63
# F4_FREQ = 349.23
# G4_FREQ = 392.00
# A4_FREQ = 440.00
# B4_FREQ = 493.88
# name = input("Введите название ноты в виде буквы и цифры, например C4: ")
# note = name[0]
# octave = int(name[1])
# # Получаем частоту ноты четвертой октавы
# if note == "C":
#  freq = C4_FREQ
# elif note == "D":
#  freq = D4_FREQ
# elif note == "E":
#  freq = E4_FREQ
# elif note == "F":
#  freq = F4_FREQ
# elif note == "G":
#  freq = G4_FREQ
# elif note == "A":
#  freq = A4_FREQ
# elif note == "B":
#  freq = B4_FREQ
# # Адаптируем частоту к конкретной октаве
# freq = freq / 2 ** (4 - octave)
# # Выводим результат
# print("Частота ноты", name, "равна", freq)

# x = (int(input(("Введите день: "))))
# y = input("Введите месяц: ")

# if x == 1 and y == "Январь":
#     print("Новый год")
# elif x == 1 and y == "Июль":
#     print("День Канады")
# elif x == 25 and y == "Декабрь":
#     print("Рождество")
# else:
#     print("Нет праздника")

# x = ((input(("Введите букву: "))))
# y = (int(input(("Введите цифру: "))))
# if x == "a":
#     x = int(1)
# elif x == "b":
#     x = int(2)
# elif x == "c":
#     x = int(1)
# elif x == "d":
#     x = int(2)
# elif x == "e":
#     x = int(1)
# elif x == "f":
#     x = int(2)
# elif x == "g":
#     x = int(1)
# elif x == "h":
#     x = int(8)
# if ((x) + y) % 2 == 1:
#     print ("белое")
# else:
#     print ("черное")

# x = ((input(("Введите месяц: "))))
# y = (int(input(("Введите день: "))))
# if x == "январь" or x == "февраль":
#     season = "зима"
# elif x == "март":
#     if y < 20:
#         season = "зима"
#     else:
#         season = "весна"
# if x == "апрель" or x == "май":
#     season = "весна"
# elif x == "июнь":
#     if y < 21:
#         season = "весна"
#     else:
#         season = "лето"
# if x == "июль" or x == "август":
#     season = "лето"
# elif x == "сентябрь":
#     if y < 22:
#         season = "лето"
#     else:
#         season = "осень"
# if x == "октябрь" or x == "ноябрь":
#     season = "осень"
# elif x == "декабрь":
#     if y < 21:
#         season = "осень"
#     else:
#         season = "зима"

# print(x, y, "сезона", season)




# x = ((input(("Введите месяц: "))))
# y = (int(input(("Введите цифру: "))))
# # if x == "декабрь":
# #     zodiac = "козерог"
# # elif x == "декабрь":
# #     if y < 22:
# #         zodiac = "стрелец"
# # else:
# #     zodiac = "козерог"

# if x == "декабрь" and 22==y<=31:
#     print("козерог")
# elif y <22:
#     print("стрелец")
# if x == "январь" and 20==y<=31:
#     print("водолей")
# elif y <20:
#     print("козерог")

# декабрь = 31
# январь = 31
# феыраль = 29

